#+title: Riff Raff

*** Ender Install
#+begin_src sh :results output
npm install -g ender
#+end_src

#+RESULTS:
: /usr/local/share/npm/bin/ender -> /usr/local/share/npm/lib/node_modules/ender/bin/ender
: ender@0.8.11 /usr/local/share/npm/lib/node_modules/ender
: ├── colors@0.6.0-1
: ├── sink-test@1.0.2
: ├── async@0.1.22
: ├── uglify-js@1.3.0
: └── npm@1.1.26

**** Baseline  packages
#+begin_src sh :results output
ender build underscore jeesh radio
#+end_src

#+RESULTS:
#+begin_example
[31mWelcome to ENDER - The no-library library[39m
-----------------------------------------
installing packages: "ender-js underscore jeesh radio"...
[33mthis can take a minute...[39m
ender-js@0.4.4 ./node_modules/ender-js 
underscore@1.4.2 ./node_modules/underscore 
radio@0.2.0 ./node_modules/radio 
jeesh@0.0.6 ./node_modules/jeesh 
├── bonzo@1.2.3
├── domready@0.2.11
├── qwery@3.3.11
└── bean@1.0.1
successfully finished installing packages
assembling packages...
[33mender.js successfully built![39m
[33mender.min.js successfully built![39m
#+end_example



